tangyangguang/Esp32_Faucet/src/app/AppController.cpp
#include "app/AppController.h"

#include "app/TimeUtils.h"

#include <algorithm>
#include <cmath>
#include <cstdio>
#include <limits>
#include <memory>
#include <new>

#ifndef NATIVE_BUILD
#include <Esp32Base.h>
#define APP_RESULT_LOG_I(tag, fmt, ...) ESP32BASE_LOG_I(tag, fmt, ##__VA_ARGS__)
#else
#define APP_RESULT_LOG_I(tag, fmt, ...) \
    do {                                \
    } while (0)
#endif

namespace faucet {
namespace {

std::uint32_t msFromSeconds(std::uint32_t seconds) {
    constexpr std::uint32_t maxMs = std::numeric_limits<std::uint32_t>::max();
    return seconds > maxMs / 1000UL ? maxMs : seconds * 1000UL;
}

WaterPulseTraceState traceStateForResult(WaterResult result) {
    switch (result) {
        case WaterResult::Completed:
            return WaterPulseTraceState::Completed;
        case WaterResult::StoppedByUser:
            return WaterPulseTraceState::Stopped;
        case WaterResult::PauseTimeout:
            return WaterPulseTraceState::PauseTimeout;
        case WaterResult::SafetyStopped:
            return WaterPulseTraceState::SafetyStopped;
        case WaterResult::FlowError:
        default:
            return WaterPulseTraceState::Error;
    }
}

bool isCancelButtonEvent(ButtonEventType type) {
    return type == ButtonEventType::CancelDown || type == ButtonEventType::CancelShort ||
           type == ButtonEventType::CancelLong;
}

constexpr std::uint32_t kResultOkCalibrationHoldMs = 5000UL;
constexpr std::uint32_t kLocalRecordCalibrationStepMl = 100UL;

MeteringSchemeRecord defaultRuntimeMeteringScheme() {
    MeteringSchemeRecord scheme{};
    initializeManualMeteringScheme(scheme, 1, "默认计量方案", defaultMeteringParameters(), 0);
    return scheme;
}

CalibrationSampleSummary makeCalibrationSummary(const WaterPulseTrace& trace,
                                                const WaterPulseTraceSample* samples,
                                                std::size_t sampleCount,
                                                std::uint32_t actualMl,
                                                const SegmentedCalibrationOptions& options) {
    CalibrationSampleSummary summary{};
    summary.actualMl = actualMl;
    summary.totalPulses = trace.totalPulses;
    summary.rejectedPulses = trace.record.rejectedPulseCount;
    summary.durationSec = trace.record.durationSec;
    summary.truncated = trace.truncated;
    summary.resumedAfterPause = trace.resumedAfterPause;
    if (!samples || sampleCount == 0 || trace.truncated || trace.resumedAfterPause || actualMl < kCalibrationMinActualMl ||
        trace.totalPulses == 0) {
        return summary;
    }
    const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(trace, samples, sampleCount, options);
    summary.stable = analysis.stable;
    summary.startupPulseCount = analysis.startupPulseCount;
    summary.stablePulseCount = analysis.stablePulseCount;
    summary.stableStartSec = analysis.stableStartSec;
    summary.stablePulsePerSec = analysis.stablePulsePerSec;
    if (!summary.stable && sampleCount >= 6 && trace.record.durationSec > 0 &&
        trace.record.durationSec < kMinCalibrationStableWindowSec) {
        summary.stable = true;
        summary.stablePulseCount = trace.totalPulses;
        summary.stablePulsePerSec = static_cast<float>(trace.totalPulses) / static_cast<float>(trace.record.durationSec);
    }
    summary.usableForGeneration = summary.stable && summary.stablePulseCount > 0;
    return summary;
}

CalibrationSampleSummary makeCalibrationSummaryFromBuckets(const WaterPulseTrace& trace,
                                                           const WaterPulseTraceBucketSample* buckets,
                                                           std::size_t bucketCount,
                                                           std::uint32_t actualMl,
                                                           const SegmentedCalibrationOptions& options) {
    CalibrationSampleSummary summary{};
    summary.actualMl = actualMl;
    summary.totalPulses = trace.totalPulses;
    summary.rejectedPulses = trace.minIntervalFilteredCount;
    summary.durationSec = trace.record.durationSec;
    summary.truncated = trace.truncated || ((trace.flags & kPulseTraceFlagStartupOverflow) != 0);
    summary.resumedAfterPause = trace.resumedAfterPause;
    if (!buckets || bucketCount == 0 || summary.truncated || trace.resumedAfterPause ||
        actualMl < kCalibrationMinActualMl || trace.totalPulses == 0) {
        return summary;
    }
    const std::uint32_t durationSec =
        trace.record.durationSec > 0
            ? trace.record.durationSec
            : static_cast<std::uint32_t>((bucketCount * kPulseTraceBucketMs + 999UL) / 1000UL);
    summary.durationSec = durationSec;
    if (durationSec == 0) {
        return summary;
    }
    std::uint32_t* perSecond = new (std::nothrow) std::uint32_t[durationSec]{};
    if (!perSecond) {
        return summary;
    }
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const std::uint32_t sec = static_cast<std::uint32_t>((i * kPulseTraceBucketMs) / 1000UL);
        if (sec < durationSec) {
            perSecond[sec] += buckets[i].pulseCount;
        }
    }
    const std::uint32_t stableWindowSec =
        std::min<std::uint32_t>(std::max<std::uint32_t>(options.stableWindowSec, kMinCalibrationStableWindowSec),
                                kMaxCalibrationStableWindowSec);
    const std::uint32_t stableTolerancePercent = std::min<std::uint32_t>(
        std::max<std::uint32_t>(options.stableTolerancePercent, kMinCalibrationStableTolerancePercent),
        kMaxCalibrationStableTolerancePercent);
    if (durationSec >= 6 && stableWindowSec <= durationSec) {
        std::uint32_t runningCount = 0;
        std::uint32_t runningTotal = 0;
        for (std::uint32_t i = durationSec / 2; i < durationSec; ++i) {
            if (perSecond[i] > 0) {
                ++runningCount;
                runningTotal += perSecond[i];
            }
        }
        if (runningCount >= 3) {
            const float stableRate = static_cast<float>(runningTotal) / static_cast<float>(runningCount);
            const std::uint32_t stableFloor = static_cast<std::uint32_t>(stableRate + 0.5f);
            for (std::uint32_t i = 0; stableFloor > 0 && i + stableWindowSec <= durationSec; ++i) {
                if (perSecond[i] < stableFloor) {
                    continue;
                }
                std::uint32_t total = 0;
                std::uint32_t minValue = UINT32_MAX;
                std::uint32_t maxValue = 0;
                for (std::uint32_t j = 0; j < stableWindowSec; ++j) {
                    const std::uint32_t value = perSecond[i + j];
                    total += value;
                    minValue = std::min(minValue, value);
                    maxValue = std::max(maxValue, value);
                }
                if (minValue == 0) {
                    continue;
                }
                const float avg = static_cast<float>(total) / static_cast<float>(stableWindowSec);
                const float avgTolerance = stableRate * static_cast<float>(stableTolerancePercent) / 100.0f;
                const float spreadTolerance =
                    stableRate * static_cast<float>(stableTolerancePercent) * 1.6f / 100.0f;
                if (std::fabs(avg - stableRate) <= std::max(1.0f, avgTolerance) &&
                    static_cast<float>(maxValue - minValue) <= std::max(1.0f, spreadTolerance)) {
                    summary.stable = true;
                    summary.stableStartSec = i;
                    for (std::uint32_t k = 0; k < i; ++k) {
                        summary.startupPulseCount += perSecond[k];
                    }
                    std::uint32_t stableSeconds = 0;
                    for (std::uint32_t k = i; k < durationSec; ++k) {
                        summary.stablePulseCount += perSecond[k];
                        ++stableSeconds;
                    }
                    summary.stablePulsePerSec =
                        stableSeconds == 0
                            ? 0.0f
                            : static_cast<float>(summary.stablePulseCount) / static_cast<float>(stableSeconds);
                    break;
                }
            }
        }
    }
    if (!summary.stable && durationSec < kMinCalibrationStableWindowSec) {
        summary.stable = true;
        summary.stablePulseCount = trace.totalPulses;
        summary.stablePulsePerSec = static_cast<float>(trace.totalPulses) / static_cast<float>(durationSec);
    }
    summary.usableForGeneration = summary.stable && summary.stablePulseCount > 0;
    delete[] perSecond;
    return summary;
}

bool appendSummaryCalibrationSample(const CalibrationAttempt& attempt,
                                    SegmentedCalibrationSample* samples,
                                    std::size_t sampleCapacity,
                                    std::size_t& sampleCount) {
    if (!samples || sampleCount >= sampleCapacity ||
        attempt.status != CalibrationAttemptStatus::Valid || !attempt.summary.usableForGeneration ||
        attempt.summary.actualMl == 0 || attempt.summary.totalPulses == 0 ||
        attempt.summary.truncated || attempt.summary.resumedAfterPause ||
        !attempt.summary.stable || attempt.summary.stablePulseCount == 0) {
        return false;
    }
    samples[sampleCount] = SegmentedCalibrationSample{
        attempt.summary.actualMl,
        attempt.summary.totalPulses,
        attempt.summary.startupPulseCount,
        attempt.summary.stablePulseCount,
        attempt.summary.stableStartSec,
        attempt.summary.stablePulsePerSec,
    };
    ++sampleCount;
    return true;
}

bool calibrationStatusExpiresWhenIdle(CalibrationSessionStatus status) {
    return status == CalibrationSessionStatus::Preparing ||
           status == CalibrationSessionStatus::WaitingLocalRun ||
           status == CalibrationSessionStatus::AwaitingActual ||
           status == CalibrationSessionStatus::ReadyToGenerate ||
           status == CalibrationSessionStatus::Generated;
}

void rejectCalibrationAttempt(CalibrationSessionRecord& session,
                              CalibrationAttempt& attempt,
                              CalibrationInvalidReason reason,
                              std::uint32_t nowSeconds) {
    attempt.status = CalibrationAttemptStatus::Invalid;
    attempt.invalidReason = reason;
    session.validSampleCount = countValidCalibrationSamples(session);
    session.status = calibrationCanStartAttempt(session) ? CalibrationSessionStatus::WaitingLocalRun
                                                        : CalibrationSessionStatus::Failed;
    session.updatedAt = nowSeconds;
}

void fillCandidateFromSegmentedResult(MeteringSchemeCandidate& candidate,
                                      const SegmentedCalibrationResult& result,
                                      std::uint32_t nowSeconds,
                                      MeteringSchemeSource sourceType) {
    candidate = MeteringSchemeCandidate{};
    candidate.ready = true;
    candidate.sourceType = sourceType;
    candidate.params = MeteringParameters{
        result.startupPulseCount,
        result.startupVolumeMl,
        result.stablePulsePerLiter,
        result.startupDurationMs,
        result.stableFlowMlPerMin,
    };
    candidate.generatedAt = nowSeconds;
    candidate.sampleCount = result.sampleCount;
    candidate.minActualMl = result.minActualMl;
    candidate.maxActualMl = result.maxActualMl;
    candidate.maxErrorMl = result.maxErrorMl;
    candidate.maxErrorTenthPercent = result.maxRelativeErrorTenthPercent;
}

}  // namespace

AppController::AppController(const SystemConfig& config,
                             StatisticsStore& statistics,
                             FilterStore& filters,
                             WaterRecordWriter& records,
                             WaterPulseTraceStore* pulseTraces,
                             WaterRecordCalibrationWriter* recordCalibrations,
                             CalibrationSessionFileStore* calibrationSessions,
                             CalibrationSessionTraceStore* calibrationSessionTraces,
                             WaterSensorManager* waterSensors)
    : AppController(config,
                    defaultRuntimeMeteringScheme(),
                    statistics,
                    filters,
                    records,
                    nullptr,
                    pulseTraces,
                    recordCalibrations,
                    calibrationSessions,
                    calibrationSessionTraces,
                    waterSensors) {}

AppController::AppController(const SystemConfig& config,
                             const MeteringSchemeRecord& activeScheme,
                             StatisticsStore& statistics,
                             FilterStore& filters,
                             WaterRecordWriter& records,
                             MeteringSchemeStore& meteringSchemes,
                             WaterPulseTraceStore* pulseTraces,
                             WaterRecordCalibrationWriter* recordCalibrations,
                             CalibrationSessionFileStore* calibrationSessions,
                             CalibrationSessionTraceStore* calibrationSessionTraces,
                             WaterSensorManager* waterSensors)
    : AppController(config,
                    activeScheme,
                    statistics,
                    filters,
                    records,
                    &meteringSchemes,
                    pulseTraces,
                    recordCalibrations,
                    calibrationSessions,
                    calibrationSessionTraces,
                    waterSensors) {}

AppController::AppController(const SystemConfig& config,
                             const MeteringSchemeRecord& activeScheme,
                             StatisticsStore& statistics,
                             FilterStore& filters,
                             WaterRecordWriter& records,
                             MeteringSchemeStore* meteringSchemes,
                             WaterPulseTraceStore* pulseTraces,
                             WaterRecordCalibrationWriter* recordCalibrations,
                             CalibrationSessionFileStore* calibrationSessions,
                             CalibrationSessionTraceStore* calibrationSessionTraces,
                             WaterSensorManager* waterSensors)
    : config_(config),
      activeMeteringScheme_(activeScheme),
      water_(config_),
      localMode_(LocalUiMode::Normal),
      buttons_(),
      flow_(activeMeteringScheme_.params, config_.pulseMinIntervalUs),
      valve_(config_.valveFullPowerSec, config_.valveHoldDutyPercent),
      statistics_(statistics),
      filters_(filters),
      records_(records),
      recordCalibrations_(recordCalibrations),
      meteringSchemes_(meteringSchemes),
      pulseTraces_(pulseTraces),
      waterSensors_(waterSensors),
      calibrationSessions_(calibrationSessions),
      calibrationSessionTraces_(calibrationSessionTraces),
      calibrationSession_{},
      activeTraceId_(0),
      activeTraceStartUs_(0),
      lastFlowVolumeMl_(0),
      currentFlowMlPerMin_(0),
      instantFlowMlPerMin_(0),
      windowFlowMlPerMin_(0),
      displayFlowMlPerMin_(0),
      runAverageFlowMlPerMin_(0),
      activeStartTimeSec_(0),
      activeStartTimeSynced_(false),
      activeStartBootId_(0),
      lastValveDesiredOpen_(false),
      calibrationValveOpen_(false),
      lastRecordWriteOk_(true),
      valveOutputSink_(nullptr),
      persistenceDirty_(false),
      configDirty_(false),
      pendingBeep_(BeepPattern::None),
      flowDroppedPulses_(0),
      resultDisplayStartMs_(0),
      resultOkHoldStartMs_(0),
      resultOkHoldActive_(false),
      resultOkCalibrationEntered_(false),
      adjustmentStepMl_(config_.volumeAdjustStepMl),
      timeAdjustmentStepSec_(config_.timeAdjustStepSec),
      localCalibrationActualMl_(0),
      localCalibrationStepMl_(kLocalRecordCalibrationStepMl),
      localCalibrationIgnoreOkUntilRelease_(false),
      localCalibrationOkReleaseSeen_(false),
      localCalibrationOkReleaseStartMs_(0),
      lastResultRecordValid_(false),
      lastResultRecord_{} {
    sanitizeConfig(config_);
    if (meteringSchemes_ &&
        (!activeMeteringScheme_.recordUsed || !validMeteringSchemeParameters(activeMeteringScheme_.params))) {
        activeMeteringScheme_ = defaultRuntimeMeteringScheme();
        flow_.setMeteringParameters(activeMeteringScheme_.params);
    }
    restoreCalibrationSession();
}

