tangyangguang/Esp32_Faucet/src/app/AppController.cpp
void AppController::resetInputs(ButtonLevels levels, std::uint32_t nowMs) {
    buttons_.reset(levels, nowMs);
}

void AppController::onFlowPulse(std::uint32_t nowUs) {
    if (pulseTraces_ && activeTraceId_ != 0) {
        pulseTraces_->appendPulseEdge(activeTraceId_, elapsedSince(nowUs, activeTraceStartUs_));
    }
    flow_.onPulse(nowUs);
}

void AppController::tick(const AppTickInput& input) {
    if (waterSensors_) {
        waterSensors_->tick(input.nowMs);
    }
    ButtonEvent event = buttons_.update(input.buttons, input.nowMs);
    if (input.buttons.cancelPressed && event.type != ButtonEventType::None && !isCancelButtonEvent(event.type)) {
        event = {ButtonEventType::CancelDown, ButtonId::Cancel};
    }
    if (input.timeSynced && waterSensors_) {
        waterSensors_->expireTdsCalibrationSession(input.nowSeconds);
    }
    expireIdleCalibrationSession(input.timeSynced ? input.nowSeconds : 0);
    handleButtonEvent(event, input.nowMs, input.nowUs, input.nowSeconds, input.timeSynced, input.bootId);
    if (localMode_ == LocalUiMode::RecordCalibration && localCalibrationIgnoreOkUntilRelease_) {
        if (input.buttons.okPressed) {
            localCalibrationOkReleaseSeen_ = false;
        } else if (!localCalibrationOkReleaseSeen_) {
            localCalibrationOkReleaseSeen_ = true;
            localCalibrationOkReleaseStartMs_ = input.nowMs;
        } else if (elapsedAtLeast(input.nowMs, localCalibrationOkReleaseStartMs_, kButtonDebounceMs)) {
            localCalibrationIgnoreOkUntilRelease_ = false;
            localCalibrationOkReleaseSeen_ = false;
        }
    }
    updateResultOkHold(input);
    if (localMode_ == LocalUiMode::Result && config_.resultDisplaySec > 0 &&
        elapsedAtLeast(input.nowMs, resultDisplayStartMs_, msFromSeconds(config_.resultDisplaySec))) {
        localMode_ = LocalUiMode::Normal;
    }

    syncFlow(input.nowUs);
    const FlowSnapshot flow = flow_.snapshot(input.nowUs);
    const bool wasRunningForSensorRun = water_.snapshot().state == WaterState::Running;
    currentFlowMlPerMin_ = flow.currentFlowMlPerMin;
    instantFlowMlPerMin_ = flow.instantFlowMlPerMin;
    windowFlowMlPerMin_ = flow.windowFlowMlPerMin;
    displayFlowMlPerMin_ = flow.displayFlowMlPerMin;
    water_.tick(input.nowMs, flow.windowFlowMlPerMin);
    if (waterSensors_ && wasRunningForSensorRun) {
        waterSensors_->sampleRun();
    }
    const WaterSnapshot waterAfterTick = water_.snapshot();
    runAverageFlowMlPerMin_ =
        waterAfterTick.elapsedSec == 0
            ? 0
            : static_cast<std::uint32_t>(
                  (static_cast<std::uint64_t>(waterAfterTick.volumeMl) * 60ULL + waterAfterTick.elapsedSec / 2ULL) /
                  waterAfterTick.elapsedSec);
    syncValve(input.nowMs);

    if (water_.hasResult()) {
        const bool calibrationRunResult =
            localMode_ == LocalUiMode::Calibration && calibrationSession_.status == CalibrationSessionStatus::Running;
        if (!calibrationRunResult && config_.resultDisplaySec > 0) {
            localMode_ = LocalUiMode::Result;
            resultDisplayStartMs_ = input.nowMs;
        }
        std::uint32_t resultStartTime = activeStartTimeSec_;
        bool resultStartSynced = activeStartTimeSynced_;
        std::uint32_t resultBootId = activeStartBootId_;
        const std::uint32_t uptimeSec = input.nowMs / 1000UL;
        if (!resultStartSynced && input.timeSynced && input.nowSeconds >= uptimeSec) {
            resultStartTime = input.nowSeconds - uptimeSec + activeStartTimeSec_;
            resultStartSynced = true;
            resultBootId = 0;
        }
        processResult(resultStartTime,
                      input.periodKeys,
                      input.periodKeysValid,
                      resultStartSynced,
                      resultBootId,
                      input.timeSynced ? input.nowSeconds : 0,
                      flow,
                      input.nowUs);
        water_.clearResult();
    }

    if (input.periodKeysValid) {
        statistics_.rollPeriods(input.periodKeys);
    }
}

AppSnapshot AppController::snapshot() const {
    AppSnapshot snapshot{};
    snapshot.water = water_.snapshot();
    snapshot.valve = valve_.output();
    snapshot.statistics = statistics_.record();
    snapshot.localMode = localMode_;
    snapshot.adjustmentStepMl = adjustmentStepMl_;
    snapshot.timeAdjustmentStepSec = timeAdjustmentStepSec_;
    snapshot.calibrationReady = lastResultRecordValid_;
    snapshot.lastResultRecordAvailable = lastResultRecordValid_;
    snapshot.lastResultRecord = lastResultRecord_;
    snapshot.calibrationActualMl = localCalibrationActualMl_;
    snapshot.calibrationStepMl = localCalibrationStepMl_;
    snapshot.calibrationStatus = calibrationSession_.status;
    snapshot.calibrationIdleExpiresAt =
        calibrationStatusExpiresWhenIdle(calibrationSession_.status) && calibrationSession_.updatedAt > 0
            ? calibrationSession_.updatedAt + kCalibrationIdleTimeoutSec
            : 0;
    snapshot.calibrationAttemptCount = calibrationSession_.attemptCount;
    snapshot.calibrationValidSampleCount = calibrationSession_.validSampleCount;
    snapshot.calibrationMaxRunSec = config_.maxOutTimeSec;
    snapshot.calibrationCanQuickGenerate = calibrationCanQuickGenerate(calibrationSession_);
    snapshot.calibrationRecommended = calibrationIsRecommended(calibrationSession_);
    bool foundCalibrationActual = false;
    for (std::uint8_t i = 0; i < calibrationSession_.attemptCount && i < kCalibrationMaxAttempts; ++i) {
        const CalibrationAttempt& attempt = calibrationSession_.attempts[i];
        if (attempt.status != CalibrationAttemptStatus::Valid || attempt.actualMl == 0) {
            continue;
        }
        if (!foundCalibrationActual) {
            snapshot.calibrationMinActualMl = attempt.actualMl;
            snapshot.calibrationMaxActualMl = attempt.actualMl;
            foundCalibrationActual = true;
        } else {
            snapshot.calibrationMinActualMl = std::min(snapshot.calibrationMinActualMl, attempt.actualMl);
            snapshot.calibrationMaxActualMl = std::max(snapshot.calibrationMaxActualMl, attempt.actualMl);
        }
    }
    snapshot.pulsePerLiter = activeMeteringScheme_.params.stablePulsePerLiter;
    snapshot.meteringParams = activeMeteringScheme_.params;
    snapshot.currentFlowMlPerMin = currentFlowMlPerMin_;
    snapshot.instantFlowMlPerMin = instantFlowMlPerMin_;
    snapshot.windowFlowMlPerMin = windowFlowMlPerMin_;
    snapshot.displayFlowMlPerMin = displayFlowMlPerMin_;
    snapshot.runAverageFlowMlPerMin = runAverageFlowMlPerMin_;
    snapshot.flowDroppedPulses = flowDroppedPulses_;
    if (waterSensors_) {
        snapshot.sensors = waterSensors_->snapshot();
    }
    snapshot.temperatureSensorEnabled = config_.temperatureEnabled;
    snapshot.tdsSensorEnabled = config_.tdsEnabled;
    return snapshot;
}

bool AppController::lastRecordWriteOk() const {
    return lastRecordWriteOk_;
}

bool AppController::consumePersistenceDirty() {
    const bool dirty = persistenceDirty_;
    persistenceDirty_ = false;
    return dirty;
}

void AppController::markPersistenceDirtyForRetry() {
    persistenceDirty_ = true;
}

bool AppController::consumeConfigDirty() {
    const bool dirty = configDirty_;
    configDirty_ = false;
    return dirty;
}

const SystemConfig& AppController::config() const {
    return config_;
}

