tangyangguang/Esp32_Faucet/src/app/AppController.cpp
const MeteringSchemeRecord& AppController::activeMeteringScheme() const {
    return activeMeteringScheme_;
}

BeepPattern AppController::consumeBeepPattern() {
    const BeepPattern pattern = pendingBeep_;
    pendingBeep_ = BeepPattern::None;
    return pattern;
}

bool AppController::emergencyStop(std::uint32_t nowMs) {
    const WaterState state = water_.snapshot().state;
    if (state == WaterState::Running || state == WaterState::Paused) {
        water_.stop(nowMs);
        syncValve(nowMs);
        pendingBeep_ = BeepPattern::Error;
        return true;
    }
    return false;
}

void AppController::setValveOutputSink(ValveOutputSink sink) {
    valveOutputSink_ = sink;
}

void AppController::setFlowDroppedPulses(std::uint32_t droppedPulses) {
    flowDroppedPulses_ = droppedPulses;
}

bool AppController::selectNextPresetForWeb() {
    return water_.selectNextPreset();
}

bool AppController::selectPreviousPresetForWeb() {
    return water_.selectPreviousPreset();
}

bool AppController::selectPresetForWeb(std::size_t index) {
    return water_.selectPreset(index);
}

bool AppController::canApplyConfig() const {
    return localMode_ != LocalUiMode::Result && localMode_ != LocalUiMode::RecordCalibration &&
           water_.canApplyConfig();
}

bool AppController::applyConfig(const SystemConfig& config) {
    if (!canApplyConfig() || !water_.applyConfig(config)) {
        return false;
    }
    SystemConfig safe = config;
    sanitizeConfig(safe);
    config_ = safe;
    flow_.setPulseFilterUs(config_.pulseMinIntervalUs);
    valve_.configure(config_.valveFullPowerSec, config_.valveHoldDutyPercent);
    adjustmentStepMl_ = config_.volumeAdjustStepMl;
    timeAdjustmentStepSec_ = config_.timeAdjustStepSec;
    if (pulseTraces_) {
        pulseTraces_->setRecentTraceLimit(kRecentPulseTraceCount);
    }
    if (waterSensors_) {
        waterSensors_->configure(config_);
    }
    return true;
}

bool AppController::applyActiveMeteringScheme(const MeteringSchemeRecord& activeScheme) {
    if (!canApplyConfig() || !activeScheme.recordUsed ||
        !validMeteringSchemeParameters(activeScheme.params)) {
        return false;
    }
    activeMeteringScheme_ = activeScheme;
    flow_.setMeteringParameters(activeMeteringScheme_.params);
    return true;
}

bool AppController::startCalibrationSessionForWeb(std::uint32_t nowSeconds) {
    if (water_.snapshot().state != WaterState::Idle || !calibrationSessions_ || !calibrationSessions_->ready() ||
        !calibrationSessionTraces_ || !calibrationSessionTraces_->ready() ||
        (calibrationSession_.status != CalibrationSessionStatus::Idle &&
         calibrationSession_.status != CalibrationSessionStatus::Applied &&
         calibrationSession_.status != CalibrationSessionStatus::Discarded &&
         calibrationSession_.status != CalibrationSessionStatus::Failed)) {
        return false;
    }
    const std::uint32_t sessionId = nowSeconds == 0 ? 1 : nowSeconds;
    if (!calibrationSessionTraces_->clearForNewSession(sessionId)) {
        return false;
    }
    initializeCalibrationSessionRecord(calibrationSession_, sessionId, nowSeconds);
    calibrationCandidate_ = MeteringSchemeCandidate{};
    calibrationSession_.status = CalibrationSessionStatus::WaitingLocalRun;
    calibrationSession_.updatedAt = nowSeconds;
    if (!saveCalibrationSession()) {
        calibrationSession_ = CalibrationSessionRecord{};
        return false;
    }
    localMode_ = LocalUiMode::Calibration;
    pendingBeep_ = BeepPattern::Click;
    return true;
}

bool AppController::discardCalibrationSessionForWeb(std::uint32_t nowSeconds) {
    if (localMode_ != LocalUiMode::Calibration || calibrationSession_.status == CalibrationSessionStatus::Running ||
        water_.snapshot().state == WaterState::Running || water_.snapshot().state == WaterState::Paused) {
        return false;
    }
    calibrationSession_.status = CalibrationSessionStatus::Discarded;
    calibrationCandidate_ = MeteringSchemeCandidate{};
    calibrationSession_.updatedAt = nowSeconds;
    const bool ok = saveCalibrationSession();
    localMode_ = LocalUiMode::Normal;
    return ok;
}

bool AppController::submitCalibrationActualForWeb(std::uint32_t actualMl, std::uint32_t nowSeconds) {
    if (calibrationSession_.status != CalibrationSessionStatus::AwaitingActual ||
        calibrationSession_.attemptCount == 0 || actualMl < kCalibrationMinActualMl || !recordCalibrations_ ||
        !calibrationSessionTraces_) {
        return false;
    }
    CalibrationAttempt& attempt = calibrationSession_.attempts[calibrationSession_.attemptCount - 1];
    const WaterPulseTrace* trace = pulseTraces_ ? pulseTraces_->findByRecord(attempt.record) : nullptr;
    const bool hasCompactTrace = trace && trace->bucketCount > 0;
    const bool hasRawTrace = trace && trace->sampleCount > 0;
    if (attempt.status != CalibrationAttemptStatus::PendingActual || !trace || trace->resumedAfterPause ||
        trace->totalPulses == 0 || (!hasCompactTrace && (!hasRawTrace || trace->truncated ||
                                                          trace->sampleCount > kPulseTraceMaxRawEdgesPerTrace))) {
        rejectCalibrationAttempt(calibrationSession_, attempt, CalibrationInvalidReason::AnalysisFailed, nowSeconds);
        saveCalibrationSession();
        return false;
    }
    std::unique_ptr<WaterPulseTraceSample[]> samples;
    std::unique_ptr<WaterPulseTraceBucketSample[]> buckets;
    std::unique_ptr<WaterPulseTraceSample[]> startupEdges;
    if (hasCompactTrace) {
        buckets.reset(new (std::nothrow) WaterPulseTraceBucketSample[trace->bucketCount]{});
        if (!buckets) {
            rejectCalibrationAttempt(calibrationSession_, attempt, CalibrationInvalidReason::StorageFailed, nowSeconds);
            saveCalibrationSession();
            return false;
        }
        for (std::size_t i = 0; i < trace->bucketCount; ++i) {
            const WaterPulseTraceBucketSample* bucket = pulseTraces_->bucketAt(*trace, i);
            if (bucket) {
                buckets[i] = *bucket;
            }
        }
        if (trace->startupEdgeCount > 0) {
            startupEdges.reset(new (std::nothrow) WaterPulseTraceSample[trace->startupEdgeCount]{});
            if (!startupEdges) {
                rejectCalibrationAttempt(calibrationSession_, attempt, CalibrationInvalidReason::StorageFailed, nowSeconds);
                saveCalibrationSession();
                return false;
            }
            for (std::size_t i = 0; i < trace->startupEdgeCount; ++i) {
                const WaterPulseTraceSample* edge = pulseTraces_->startupEdgeAt(*trace, i);
                if (edge) {
                    startupEdges[i] = *edge;
                }
            }
        }
    } else {
        samples.reset(new (std::nothrow) WaterPulseTraceSample[trace->sampleCount]{});
        if (!samples) {
            rejectCalibrationAttempt(calibrationSession_, attempt, CalibrationInvalidReason::StorageFailed, nowSeconds);
            saveCalibrationSession();
            return false;
        }
        for (std::size_t i = 0; i < trace->sampleCount; ++i) {
            const WaterPulseTraceSample* sample = pulseTraces_->sampleAt(*trace, i);
            if (sample) {
                samples[i] = *sample;
            }
        }
    }
    const CalibrationSampleSummary summary =
        hasCompactTrace
            ? makeCalibrationSummaryFromBuckets(*trace,
                                                buckets.get(),
                                                trace->bucketCount,
                                                actualMl,
                                                segmentedCalibrationOptionsFromConfig(config_))
            : makeCalibrationSummary(*trace,
                                     samples.get(),
                                     trace->sampleCount,
                                     actualMl,
                                     segmentedCalibrationOptionsFromConfig(config_));
    CalibrationStoredTrace stored{};
    stored.pendingActual = true;
    stored.sessionId = calibrationSession_.sessionId;
    stored.attemptIndex = attempt.attemptIndex;
    stored.trace = *trace;

    WaterRecordCalibration calibration = makeWaterRecordCalibration(attempt.record);
    calibration.actualMl = actualMl;
    calibration.calibratedAt = nowSeconds;
    calibration.oldPulsePerMl = static_cast<float>(activeMeteringScheme_.params.stablePulsePerLiter) / 1000.0f;
    calibration.newPulsePerMl = calibration.oldPulsePerMl;
    calibration.oldStartupCompensationMl = activeMeteringScheme_.params.startupVolumeMl;
    calibration.newStartupCompensationMl = activeMeteringScheme_.params.startupVolumeMl;
    calibration.kind = WaterRecordCalibrationKind::PulsePerMl;
    const bool savedTrace =
        hasCompactTrace
            ? calibrationSessionTraces_->savePending(attempt.sessionTraceSlot,
                                                     stored,
                                                     buckets.get(),
                                                     trace->bucketCount,
                                                     startupEdges.get(),
                                                     trace->startupEdgeCount)
            : calibrationSessionTraces_->savePending(attempt.sessionTraceSlot,
                                                     stored,
                                                     samples.get(),
                                                     trace->sampleCount);
    if (!recordCalibrations_->upsert(calibration) ||
        !savedTrace || !calibrationSessionTraces_->commitValid(attempt.sessionTraceSlot, actualMl, nowSeconds)) {
        rejectCalibrationAttempt(calibrationSession_, attempt, CalibrationInvalidReason::StorageFailed, nowSeconds);
        saveCalibrationSession();
        return false;
    }

    attempt.actualMl = actualMl;
    attempt.summary = summary;
    attempt.status = CalibrationAttemptStatus::Valid;
    attempt.invalidReason = CalibrationInvalidReason::None;
    calibrationSession_.validSampleCount = countValidCalibrationSamples(calibrationSession_);
    calibrationSession_.updatedAt = nowSeconds;
    if (pulseTraces_) {
        pulseTraces_->setActualMlByRecord(attempt.record, actualMl);
    }
    pendingBeep_ = BeepPattern::Done;
    if (calibrationCanQuickGenerate(calibrationSession_)) {
        return refreshCalibrationCandidate(nowSeconds);
    }
    clearCalibrationCandidate();
    calibrationSession_.status = calibrationCanStartAttempt(calibrationSession_) ? CalibrationSessionStatus::WaitingLocalRun
                                                                                : CalibrationSessionStatus::Failed;
    return saveCalibrationSession();
}

bool AppController::removeCalibrationSessionSampleForWeb(std::uint8_t attemptIndex, std::uint32_t nowSeconds) {
    if (water_.snapshot().state != WaterState::Idle) {
        return false;
    }

    std::uint8_t selectedIndex = kCalibrationMaxAttempts;
    for (std::uint8_t i = 0; i < calibrationSession_.attemptCount && i < kCalibrationMaxAttempts; ++i) {
        const CalibrationAttempt& attempt = calibrationSession_.attempts[i];
        if (attempt.attemptIndex == attemptIndex) {
            selectedIndex = i;
            break;
        }
    }
    const CalibrationAttempt* selected =
        selectedIndex < kCalibrationMaxAttempts ? &calibrationSession_.attempts[selectedIndex] : nullptr;
    if (!selected || (selected->status != CalibrationAttemptStatus::Valid &&
                      selected->status != CalibrationAttemptStatus::PendingActual)) {
        return false;
    }
    std::unique_ptr<CalibrationSessionRecord> originalSession(new (std::nothrow) CalibrationSessionRecord(calibrationSession_));
    std::unique_ptr<CalibrationSessionRecord> nextSession(new (std::nothrow) CalibrationSessionRecord(calibrationSession_));
    if (!originalSession || !nextSession) {
        return false;
    }
    CalibrationAttempt& nextAttempt = nextSession->attempts[selectedIndex];
    nextAttempt.status = CalibrationAttemptStatus::Removed;
    nextAttempt.skipReason = CalibrationSkipReason::None;
    nextAttempt.invalidReason = CalibrationInvalidReason::None;
    nextSession->validSampleCount = countValidCalibrationSamples(*nextSession);
    nextSession->updatedAt = nowSeconds;
    const bool canQuickGenerateAfterRemove = calibrationCanQuickGenerate(*nextSession);
    nextSession->status = canQuickGenerateAfterRemove ? CalibrationSessionStatus::ReadyToGenerate
                                                      : (calibrationCanStartAttempt(*nextSession)
                                                             ? CalibrationSessionStatus::WaitingLocalRun
                                                             : CalibrationSessionStatus::Failed);

    if (!calibrationSessions_ || !calibrationSessions_->ready() || !calibrationSessions_->save(*nextSession)) {
        return false;
    }

    if (calibrationSessionTraces_ && selected->sessionTraceSlot < kCalibrationSessionTraceSlots &&
        !calibrationSessionTraces_->invalidate(selected->sessionTraceSlot)) {
        calibrationSessions_->save(*originalSession);
        return false;
    }

    calibrationSession_ = *nextSession;
    clearCalibrationCandidate();
    if (canQuickGenerateAfterRemove) {
        return refreshCalibrationCandidate(nowSeconds);
    }
    return true;
}

bool AppController::skipCalibrationAttemptForWeb(CalibrationSkipReason reason, std::uint32_t nowSeconds) {
    if (calibrationSession_.status != CalibrationSessionStatus::AwaitingActual ||
        calibrationSession_.attemptCount == 0) {
        return false;
    }
    CalibrationAttempt& attempt = calibrationSession_.attempts[calibrationSession_.attemptCount - 1];
    if (calibrationSessionTraces_ && attempt.sessionTraceSlot < kCalibrationSessionTraceSlots) {
        calibrationSessionTraces_->invalidate(attempt.sessionTraceSlot);
    }
    attempt.status = CalibrationAttemptStatus::Skipped;
    attempt.skipReason = reason;
    calibrationSession_.status = calibrationCanStartAttempt(calibrationSession_) ? CalibrationSessionStatus::WaitingLocalRun
                                                                                : CalibrationSessionStatus::Failed;
    calibrationSession_.updatedAt = nowSeconds;
    return saveCalibrationSession();
}

