tangyangguang/Esp32_Faucet/src/app/AppController.cpp
void AppController::handleLocalRecordCalibrationEvent(ButtonEvent event, std::uint32_t nowSeconds) {
    switch (event.type) {
        case ButtonEventType::CancelDown:
        case ButtonEventType::CancelShort:
        case ButtonEventType::CancelLong:
            localMode_ = LocalUiMode::Result;
            localCalibrationIgnoreOkUntilRelease_ = false;
            localCalibrationOkReleaseSeen_ = false;
            pendingBeep_ = BeepPattern::Click;
            break;
        case ButtonEventType::PlusShort:
        case ButtonEventType::PlusLong: {
            const std::uint32_t next =
                localCalibrationActualMl_ > kMaxVolumePresetMl - localCalibrationStepMl_
                    ? kMaxVolumePresetMl
                    : localCalibrationActualMl_ + localCalibrationStepMl_;
            if (next != localCalibrationActualMl_) {
                localCalibrationActualMl_ = next;
                pendingBeep_ = BeepPattern::Click;
            }
            break;
        }
        case ButtonEventType::MinusShort:
        case ButtonEventType::MinusLong: {
            const std::uint32_t next =
                localCalibrationActualMl_ <= kCalibrationMinActualMl + localCalibrationStepMl_
                    ? kCalibrationMinActualMl
                    : localCalibrationActualMl_ - localCalibrationStepMl_;
            if (next != localCalibrationActualMl_) {
                localCalibrationActualMl_ = next;
                pendingBeep_ = BeepPattern::Click;
            }
            break;
        }
        case ButtonEventType::OkShort: {
            if (localCalibrationIgnoreOkUntilRelease_) {
                localCalibrationIgnoreOkUntilRelease_ = false;
                localCalibrationOkReleaseSeen_ = false;
                break;
            }
            const CalibrationApplyResult result =
                lastResultRecordValid_
                    ? applyCalibrationFromRecordInternal(lastResultRecord_, localCalibrationActualMl_, true, nowSeconds)
                    : CalibrationApplyResult::InvalidRecord;
            if (result != CalibrationApplyResult::Saved) {
                pendingBeep_ = BeepPattern::Error;
            }
            break;
        }
        case ButtonEventType::OkLong:
            if (localCalibrationIgnoreOkUntilRelease_) {
                localCalibrationIgnoreOkUntilRelease_ = false;
                localCalibrationOkReleaseSeen_ = false;
                break;
            }
            break;
        case ButtonEventType::None:
        default:
            break;
    }
}

void AppController::restoreCalibrationSession() {
    calibrationSession_ = CalibrationSessionRecord{};
    if (!calibrationSessions_ || !calibrationSessions_->ready()) {
        return;
    }
    if (!calibrationSessions_->load(calibrationSession_)) {
        return;
    }
    if (calibrationSession_.status == CalibrationSessionStatus::Running) {
        if (calibrationSession_.attemptCount > 0) {
            CalibrationAttempt& attempt = calibrationSession_.attempts[calibrationSession_.attemptCount - 1];
            attempt.status = CalibrationAttemptStatus::Invalid;
            attempt.invalidReason = CalibrationInvalidReason::ErrorResult;
            if (calibrationSessionTraces_ && attempt.sessionTraceSlot < kCalibrationSessionTraceSlots) {
                calibrationSessionTraces_->invalidate(attempt.sessionTraceSlot);
            }
        }
        calibrationSession_.status = CalibrationSessionStatus::WaitingLocalRun;
        saveCalibrationSession();
    }
    invalidateAwaitingActualIfRamTraceMissing(0);
    if (calibrationSession_.status == CalibrationSessionStatus::Preparing ||
        calibrationSession_.status == CalibrationSessionStatus::WaitingLocalRun ||
        calibrationSession_.status == CalibrationSessionStatus::AwaitingActual ||
        calibrationSession_.status == CalibrationSessionStatus::ReadyToGenerate ||
        calibrationSession_.status == CalibrationSessionStatus::Generated) {
        localMode_ = LocalUiMode::Calibration;
    }
}

void AppController::expireIdleCalibrationSession(std::uint32_t nowSeconds) {
    if (nowSeconds == 0 || localMode_ != LocalUiMode::Calibration ||
        !calibrationStatusExpiresWhenIdle(calibrationSession_.status) ||
        calibrationSession_.updatedAt == 0 || nowSeconds < calibrationSession_.updatedAt ||
        nowSeconds - calibrationSession_.updatedAt < kCalibrationIdleTimeoutSec) {
        return;
    }
    calibrationSession_.status = CalibrationSessionStatus::Discarded;
    calibrationCandidate_ = MeteringSchemeCandidate{};
    calibrationSession_.updatedAt = nowSeconds;
    saveCalibrationSession();
    localMode_ = LocalUiMode::Normal;
}

bool AppController::invalidateAwaitingActualIfRamTraceMissing(std::uint32_t nowSeconds) {
    if (calibrationSession_.status != CalibrationSessionStatus::AwaitingActual ||
        calibrationSession_.attemptCount == 0) {
        return false;
    }
    CalibrationAttempt& attempt = calibrationSession_.attempts[calibrationSession_.attemptCount - 1];
    if (attempt.status != CalibrationAttemptStatus::PendingActual) {
        return false;
    }
    const WaterPulseTrace* trace = pulseTraces_ ? pulseTraces_->findByRecord(attempt.record) : nullptr;
    if (trace && trace->sampleCount > 0) {
        return false;
    }
    attempt.status = CalibrationAttemptStatus::Invalid;
    attempt.invalidReason = CalibrationInvalidReason::MissingActualMl;
    calibrationSession_.status = calibrationCanStartAttempt(calibrationSession_) ? CalibrationSessionStatus::WaitingLocalRun
                                                                                : CalibrationSessionStatus::Failed;
    if (nowSeconds != 0) {
        calibrationSession_.updatedAt = nowSeconds;
    }
    saveCalibrationSession();
    return true;
}

bool AppController::saveCalibrationSession() {
    return calibrationSessions_ && calibrationSessions_->ready() && calibrationSessions_->save(calibrationSession_);
}

