tangyangguang/Esp32_Faucet/src/app/AppController.cpp
void AppController::processResult(std::uint32_t startTime,
                                  const PeriodKeys& periodKeys,
                                  bool periodKeysValid,
                                  bool startTimeSynced,
                                  std::uint32_t bootId,
                                  std::uint32_t nowSeconds,
                                  const FlowSnapshot& flow,
                                  std::uint32_t nowUs) {
    const WaterTaskResult result = water_.result();
    if (!result.valid) {
        return;
    }

    WaterRecord record{
        startTime,
        result.volumeMl,
        result.targetValue,
        flow.pulseCount,
        flow.rejectedPulses,
        result.durationSec,
        result.mode,
        result.result,
        result.selectedPreset,
        0,
        activeMeteringScheme_.id,
        {0, 0, 0, 0},
    };
    if (!startTimeSynced) {
        markWaterRecordBootId(record, bootId);
    }
    if (waterSensors_) {
        const WaterSensorRunSummary sensors = waterSensors_->finishRun();
        record.temperatureAvgCentiC = sensors.temperatureAvgCentiC;
        record.temperatureMinCentiC = sensors.temperatureMinCentiC;
        record.temperatureMaxCentiC = sensors.temperatureMaxCentiC;
        record.tdsAvgPpm = sensors.tdsAvgPpm;
        record.tdsMinPpm = sensors.tdsMinPpm;
        record.tdsMaxPpm = sensors.tdsMaxPpm;
        record.tdsVoltageAvgMv = sensors.tdsVoltageAvgMv;
        record.sensorSampleCount = sensors.sensorSampleCount;
        record.sensorFlags = sensors.sensorFlags;
        record.tdsCalibrationRevisionAtRun = sensors.tdsCalibrationRevisionAtRun;
        record.tdsCalibrationModeAtRun = sensors.tdsCalibrationModeAtRun;
        record.tdsCalibratedAtRun = sensors.tdsCalibratedAtRun;
        record.tdsTemperatureCompensatedAtRun = sensors.tdsTemperatureCompensatedAtRun;
        record.tdsTempFallback25CAtRun = sensors.tdsTempFallback25CAtRun;
    }

    APP_RESULT_LOG_I("app",
                     "water_result_ready result=%u volume_ml=%lu target=%lu pulses=%lu scheme_id=%lu",
                     static_cast<unsigned>(result.result),
                     static_cast<unsigned long>(record.volumeMl),
                     static_cast<unsigned long>(record.targetValue),
                     static_cast<unsigned long>(record.pulseCount),
                     static_cast<unsigned long>(record.meteringSchemeId));
    const WaterPulseTraceState traceState = traceStateForResult(result.result);
    finishPulseTrace(record, traceState, flow, nowUs);

    lastResultRecord_ = WaterRecord{};
    lastResultRecordValid_ = false;
    APP_RESULT_LOG_I("app", "water_record_append_begin");
    lastRecordWriteOk_ = records_.append(record);
    APP_RESULT_LOG_I("app", "water_record_append_done ok=%s", lastRecordWriteOk_ ? "yes" : "no");
    if (lastRecordWriteOk_ && recordCalibrations_ && record.pulseCount > 0 &&
        waterResultAllowsCalibration(record.result)) {
        lastResultRecord_ = record;
        lastResultRecordValid_ = true;
        localCalibrationActualMl_ =
            std::min<std::uint32_t>(kMaxVolumePresetMl,
                                    std::max<std::uint32_t>(kCalibrationMinActualMl, record.volumeMl));
        localCalibrationStepMl_ = kLocalRecordCalibrationStepMl;
    }
    if (periodKeysValid) {
        statistics_.addWater(result.volumeMl, periodKeys);
    }
    filters_.addWater(result.volumeMl);
    APP_RESULT_LOG_I("app",
                     "water_runtime_totals_updated period_keys=%s today_ml=%lu total_ml=%lu",
                     periodKeysValid ? "valid" : "invalid",
                     static_cast<unsigned long>(statistics_.record().todayMl),
                     static_cast<unsigned long>(statistics_.record().totalMl));
    persistCalibrationPendingAttempt(record, nowSeconds);
    persistenceDirty_ = true;
    pendingBeep_ = result.result == WaterResult::Completed ? BeepPattern::Done : BeepPattern::Error;
}

}  // namespace faucet
